jacob-heathorn/mimxrt1170evk/test/cm4/hello_world/hello_world_cm4.cpp
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2020 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "clock_config.h"
#include "board.h"
#include "mcmgr.h"
#include "registers/gpio9.hpp"
#include "registers/iomuxc.hpp"
#include "registers/ccm.hpp"

#include "fsl_gpio.h"
volatile bool g_pinSet = false;
/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define LED_INIT()                   \
    gpio_pin_config_t led_config = { \
        kGPIO_DigitalOutput,         \
        0,                           \
    };                               \
    GPIO_PinInit(BOARD_USER_LED_GPIO, BOARD_USER_LED_GPIO_PIN, &led_config);


/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/

/*!
 * @brief Application-specific implementation of the SystemInitHook() weak function.
 */
void SystemInitHook(void)
{
    /* Initialize MCMGR - low level multicore management library. Call this
       function as close to the reset entry as possible to allow CoreUp event
       triggering. The SystemInitHook() weak function overloading is used in this
       application. */
    (void)MCMGR_EarlyInit();
}


void BoardInitPins()
{
    // Enable the IOMUXC clock and wait for it.
    nCCM::LPCG49_DIRECT::Instance().bits.ON = nCCM::LPCG49_DIRECT::eON::eON_1;
    while (nCCM::LPCG49_STATUS0::Instance().bits.ON != nCCM::LPCG49_STATUS0::eON::eON_1) {}
    
    // Set GPIO9, pin3 mux, for LED.
    nIOMUXC::SW_MUX_CTL_PAD_GPIO_AD_04::Instance().bits.MUX_MODE = 
        nIOMUXC::SW_MUX_CTL_PAD_GPIO_AD_04::eMUX_MODE::eALT10_gpio9_IO3;
}

void UserLedGpioInit()
{
    nCCM::LPCG51_DIRECT::Instance().bits.ON = nCCM::LPCG51_DIRECT::eON::eON_1;
    
    // auto &gdir = nGPIO9::GDIR::Instance();
    // auto & edge_sel = nGPIO9::EDGE_SEL::Instance();
    // auto & icr1 = nGPIO9::ICR1::Instance();
    // auto & icr2 = nGPIO9::ICR2::Instance();
}


/*!
 * @brief Main function
 */
int main(void)
{
    uint32_t startupData, i;
    mcmgr_status_t status;

    /* Init board hardware.*/
    BOARD_ConfigMPU();
    BoardInitPins();
    SystemCoreClock = CLOCK_GetRootClockFreq(kCLOCK_Root_M4);

    /* Initialize MCMGR, install generic event handlers */
    (void)MCMGR_Init();

    /* Get the startup data */
    do
    {
        status = MCMGR_GetStartupData(&startupData);
    } while (status != kStatus_MCMGR_Success);

    /* Make a noticable delay after the reset */
    /* Use startup parameter from the master core... */
    for (i = 0; i < startupData; i++)
    {
        SDK_DelayAtLeastUs(1000000U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
    }

    /* Configure LED */
    LED_INIT();
    auto &lpcg49_direct = nCCM::LPCG49_DIRECT::Instance();

    // auto &gdir = nGPIO9::GDIR::Instance();
    // auto & edge_sel = nGPIO9::EDGE_SEL::Instance();
    // auto & icr1 = nGPIO9::ICR1::Instance();
    // auto & icr2 = nGPIO9::ICR2::Instance();

    for (int j = 0; j < 20; ++j)
    {
        //SDK_DelayAtLeastUs(500000U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);

        for (int i = 0; i < 1000000; ++i)
        {
            int y = i * 3 / 2;
            (void)y;
        }
        nGPIO9::DR_TOGGLE::Instance().bits.DR_TOGGLE = 8;
    }

    for (;;)
    {
        //SDK_DelayAtLeastUs(500000U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);

        for (int i = 0; i < 10000000; ++i)
        {
            int y = i * 3 / 2;
            (void)y;
        }
        nGPIO9::DR_TOGGLE::Instance().bits.DR_TOGGLE = 8;
    }
}
